uhnp/src/Documents/ПоступлениеМСФО/ПоступлениеМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеМСФО</name>
  <basedOn>Document.ОплатаМСФО</basedOn>
  <registerRecords>AccumulationRegister.ДвижениеИнвестиций</registerRecords>
  <registerRecords>InformationRegister.СтатусыОбъектовИнвестирования</registerRecords>
  <registerRecords>InformationRegister.ПоследовательностиУчастия</registerRecords>
  <registerRecords>AccountingRegister.МСФО</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.ВидыОперацийУчетаМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСВключенВСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыУчетаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.ПараметрыОбъектовУчетаМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>КратностьВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>DefinedType.ТипЦенНоменклатуры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Позиции</name>
    <attributes>
      <name>Актив</name>
      <type>
        <types>DefinedType.АктивМСФО</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНалоговМСФО</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрыУчета</name>
      <type>
        <types>CatalogRef.ПараметрыОбъектовУчетаМСФО</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрыАмортизации</name>
      <type>
        <types>CatalogRef.ПараметрыАмортизацииВНАМСФО</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДоп</name>
      <type>
        <types>DefinedType.ДоляВладенияНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтношениеКГруппе</name>
      <type>
        <types>CatalogRef.ГруппыКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/ЗначенияКотировокФИ/ЗначенияКотировокФИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияКотировокФИ</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>DefinedType.ТипЗначениеКотировки</types>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>DefinedType.ТипЗначениеКотировки</types>
    </type>
  </resources>
  <attributes>
    <name>КолонкаКотировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидКотировки</name>
    <type>
      <types>DefinedType.ИсточникКотировки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/AccountingRegisters/МСФО/МСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>МСФО</name>
  <chartOfAccounts>ChartOfAccounts.МСФО</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.ВидыОпераций</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.УчетПоНаправлениямДеятельности</accountingFlag>
  </dimensions>
  <resources>
    <name>СуммаВВалютеУчета</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаВВалютеОтчетности</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетДтИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКтИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоДт</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоКт</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

uhnp/src/AccumulationRegisters/ДвижениеИнвестиций/ДвижениеИнвестиций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвижениеИнвестиций</name>
  <resources>
    <name>Инвестиции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрямаяДоляВладения</name>
    <type>
      <types>DefinedType.ДоляВладения</types>
    </type>
  </resources>
  <resources>
    <name>БалансоваяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПривилегированных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВДоверительномУправлении</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоГолосующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Инвестор</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектИнвестирования</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/Enums/ВидыОтношенийКГруппе/ВидыОтношенийКГруппе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОтношенийКГруппе</name>
  <enumValues>
    <name>Материнское</name>
    <comment>Консолидируется и является основной единицей холдинга, на которую заведены все инвестиции</comment>
  </enumValues>
  <enumValues>
    <name>Дочернее</name>
    <comment>Консолидируется в отчетности Группы</comment>
  </enumValues>
  <enumValues>
    <name>Ассоциированное</name>
    <comment>Не консолидируются в отчетности Группы, отражаются по методу долевого участия(инвестиция равна доли в чистых активах)</comment>
  </enumValues>
  <enumValues>
    <name>Совместное</name>
    <comment>Не консолидируются в отчетности Группы, отражаются по методу долевого участия(инвестиция равна доли в чистых активах)</comment>
  </enumValues>
  <enumValues>
    <name>СвязанныеСтороны</name>
    <comment>Не консолидируются, используется для сбора данных в части раскрытия операций со связанными сторонами</comment>
  </enumValues>
  <enumValues>
    <name>ТретьиСтороны</name>
    <comment>Не консолидируются в периметре</comment>
  </enumValues>
  <enumValues>
    <name>СовместныеОперации</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ПараметрыОбъектовУчетаМСФО/ПараметрыОбъектовУчетаМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПараметрыОбъектовУчетаМСФО</name>
  <attributes>
    <name>ПланСчетовБД</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъектаУчета</name>
    <type>
      <types>CatalogRef.ВидыОбъектовУчетаМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>CatalogRef.СчетаУчетаМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДоходов</name>
    <type>
      <types>CatalogRef.СчетаУчетаМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасходов</name>
    <type>
      <types>CatalogRef.СчетаУчетаМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыАванса</name>
    <type>
      <types>CatalogRef.ПараметрыОбъектовУчетаМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыНДС</name>
    <type>
      <types>CatalogRef.ПараметрыОбъектовУчетаМСФО</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Documents/ПоступлениеМСФО/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Поля.Добавить("Ссылка");
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("ВидОперации");

КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	Если Не Данные.Свойство("ВидОперации") Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	
	Шаблон = НСтр("ru = 'Поступление: %1 %2 от %3'");	
	Представление = СтрШаблон(Шаблон, Данные.ВидОперации, Данные.Номер, Формат(Данные.Дата, "ДЛФ=DT"));

КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти
 
#Область Проведение

Функция ПодготовитьПараметрыПроведения(ДополнительныеСвойства, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);

	ДопРеквизиты = Новый Структура("ЕстьДоли, ВидОперации", "ВидОперации.ЕстьДоли");
	Реквизиты = МСФОУХ.РеквизитыДокумента(Запрос, ДопРеквизиты, , Отказ);
	ДополнительныеСвойства.ДляПроведения.Вставить("Реквизиты", Реквизиты);
	
	Если Отказ Тогда
		Возврат ДополнительныеСвойства;
	КонецЕсли;
	
	РегистрыСведений.ЗначенияКотировокФИ.ЗаполнитьКроссКурсВО(Запрос, Реквизиты);
	
	Запрос.УстановитьПараметр("ГраницаДоДокумента",		МСФОВызовСервераУХ.ПолучитьГраницуДоДокумента(Реквизиты.Период, Реквизиты.Ссылка));
	Запрос.УстановитьПараметр("Организация",			Реквизиты.Организация);
	Запрос.УстановитьПараметр("Сценарий",				Реквизиты.Сценарий);
	Запрос.УстановитьПараметр("ПланСчетовМСФО", 		Реквизиты.ПланСчетовМСФО);
	Запрос.УстановитьПараметр("ФункциональнаяВалюта", 	Реквизиты.ФункциональнаяВалюта);
	Запрос.УстановитьПараметр("УчетнаяПолитика", 		Реквизиты.УчетнаяПолитика);

	ПутиСубконто = МСФОУХ.ПутиСубконто();
	
	НомераТаблиц = Новый Структура;
	ТекстЗапроса = Новый Массив;
	
	ТекстЗапроса.Добавить(ТекстЗапроса_втРасчеты(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втПозиции(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втИтогПозиций(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втОстаткиАвансов(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втПогашенияАвансов(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втСчетаУчета(НомераТаблиц, ПутиСубконто));
	ТекстЗапроса.Добавить(ТекстЗапроса_МСФО(НомераТаблиц, ПутиСубконто));
	
	Если Реквизиты.ЕстьДоли И ИдентификацияПродуктаУХКлиентСервер.ЭтоУправлениеХолдингом() Тогда
		ТекстЗапроса.Добавить(ТекстЗапроса_ДвижениеИнвестиций(НомераТаблиц));
		ТекстЗапроса.Добавить(ТекстЗапроса_ИсточникРасчетаЭффективныхДолей(НомераТаблиц));
	КонецЕсли;

	Запрос.Текст = СтрСоединить(ТекстЗапроса, ОбщегоНазначенияУХВызовСервера.ТекстРазделителяЗапросовПакета());
	Результат = ПроведениеСерверУХ.ДополнитьТаблицамиИзПакетаЗапросов(
			ДополнительныеСвойства.ТаблицыДляДвижений, Запрос, НомераТаблиц);

	Если Метаданные.РегистрыСведений.Найти("СтатусыОбъектовИнвестирования") <> Неопределено Тогда
		РегистрыСведений["СтатусыОбъектовИнвестирования"].ДобавитьТаблицуДляДвижений(
			ДополнительныеСвойства, Отказ);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_втРасчеты(НомераТаблиц)
	
	НомераТаблиц.Вставить("втРасчеты", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка,
	|	т.ВидОперации КАК ВидОперации,
	|	т.Контрагент КАК Контрагент,
	|	т.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	т.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА т.КурсВзаиморасчетов = 0
	|			ТОГДА 1
	|		ИНАЧЕ т.КурсВзаиморасчетов
	|	КОНЕЦ КАК КурсВД,
	|	ВЫБОР
	|		КОГДА т.КратностьВзаиморасчетов = 0
	|			ТОГДА 1
	|		ИНАЧЕ т.КратностьВзаиморасчетов
	|	КОНЕЦ КАК КратностьВД,
	|	1 КАК КурсФВ,
	|	1 КАК КратностьФВ,
	|	&КурсВО КАК КурсВО,
	|	&КратностьВО КАК КратностьВО,
	|	т.ПараметрыУчетаВзаиморасчетов КАК ПараметрыУчетаДКЗ,
	|	т.ПараметрыУчетаВзаиморасчетов.ПараметрыАванса.СчетУчета КАК АналитикаАванс,
	|	т.ПараметрыУчетаВзаиморасчетов.СчетУчета КАК АналитикаДКЗ,
	|	т.ПараметрыУчетаВзаиморасчетов.ПараметрыАванса.СчетУчета.Счет.СчетСсылка КАК СчетАванса,
	|	т.Подразделение КАК Подразделение,
	|	т.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ втРасчеты
	|ИЗ
	|	Документ.ПоступлениеМСФО КАК т
	|ГДЕ
	|	т.Ссылка = &Ссылка";

КонецФункции

Функция ТекстЗапроса_втПозиции(НомераТаблиц)
	
	НомераТаблиц.Вставить("втПозиции", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка,
	|	т.НомерСтроки КАК НомерСтроки,
	|	т.Актив КАК Актив,
	|	т.Количество КАК Количество,
	|	т.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА т.Ссылка.НДСВключенВСтоимость
	|			ТОГДА т.Сумма - т.СуммаНДС
	|		ИНАЧЕ т.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА т.Ссылка.НДСВключенВСтоимость
	|			ТОГДА т.Сумма
	|		ИНАЧЕ т.Сумма - т.СуммаНДС
	|	КОНЕЦ КАК СуммаСНДС,
	|	т.Сумма КАК Сумма,
	|	т.СтавкаНДС КАК СтавкаНДС,
	|	т.СуммаНДС КАК СуммаНДС,
	|	т.ПараметрыУчета.СчетУчета КАК АналитикаАктив,
	|	т.ПараметрыУчета.ПараметрыНДС.СчетУчета КАК АналитикаНДС,
	|	т.ПараметрыУчета.ПараметрыНДС.СчетДоходов КАК АналитикаДНДС,
	|	т.ПараметрыУчета КАК ПараметрыУчетаАктива,
	|	т.КоличествоДоп КАК КоличествоДоп,
	|	т.ОтношениеКГруппе КАК ОтношениеКГруппе,
	|	ВЫБОР
	|		КОГДА НЕ т.Ссылка.ВидОперации.ЕстьДоли
	|				ИЛИ т.ПараметрыУчета.ВидОбъектаУчета.РазделПланаСчетов <> ЗНАЧЕНИЕ(Справочник.РазделыПланаСчетов.ПрочиеАктивыОбязательства)
	|			ТОГДА NULL
	|		КОГДА т.Актив ССЫЛКА Справочник.Контрагенты
	|				И ВЫРАЗИТЬ(т.Актив КАК Справочник.Контрагенты).ОрганизационнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА т.Актив.ОрганизационнаяЕдиница
	|		КОГДА т.Актив ССЫЛКА Справочник.Организации
	|			ТОГДА т.Актив
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ОбъектИнвестирования,
	|	т.Содержание КАК Содержание
	|ПОМЕСТИТЬ втПозиции
	|ИЗ
	|	Документ.ПоступлениеМСФО.Позиции КАК т
	|ГДЕ
	|	т.Ссылка = &Ссылка";

КонецФункции

Функция ТекстЗапроса_втИтогПозиций(НомераТаблиц)

	НомераТаблиц.Вставить("втИтогПозиций", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	ЕстьNULL(СУММА(т.СуммаСНДС), 0) КАК СуммаСНДС
	|ПОМЕСТИТЬ втИтогПозиций
	|ИЗ
	|	втПозиции КАК т";

КонецФункции

Функция ТекстЗапроса_втОстаткиАвансов(НомераТаблиц)
	
	НомераТаблиц.Вставить("втОстаткиАвансов", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	т.Субконто2.Дата КАК ДатаАванса,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
	|	т.Счет КАК Счет,
	|	т.Субконто1 КАК Субконто1,
	|	т.Субконто2 КАК Субконто2,
	|	т.Субконто3 КАК Субконто3,
	|	т.Валюта КАК Валюта,
	|	т.Подразделение КАК Подразделение,
	|	т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА т.Счет.Валютный
	|			ТОГДА т.СуммаВВалютеОстаток
	|		ИНАЧЕ т.СуммаВВалютеУчетаОстаток
	|	КОНЕЦ КАК СуммаВВалюте,
	|	т.СуммаВВалютеУчетаОстаток КАК СуммаВВалютеУчета,
	|	т.СуммаВВалютеОтчетностиОстаток КАК СуммаВВалютеОтчетности
	|ПОМЕСТИТЬ втОстаткиАвансов
	|ИЗ
	|	РегистрБухгалтерии.МСФО.Остатки(
	|			&Дата,
	|			Счет В
	|				(ВЫБРАТЬ
	|					с.СчетАванса
	|				ИЗ
	|					втРасчеты КАК с),
	|			,
	|			Организация = &Организация
	|				И Сценарий = &Сценарий
	|				И Субконто2 В
	|					(ВЫБРАТЬ
	|						д.ДоговорКонтрагента
	|					ИЗ
	|						втРасчеты КАК д)) КАК т
	|ГДЕ
	|	т.СуммаВВалютеУчетаОстаток > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДатаАванса";

КонецФункции

Функция ТекстЗапроса_втПогашенияАвансов(НомераТаблиц)
	
	НомераТаблиц.Вставить("втПогашенияАвансов", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	т.НомерЗаписи КАК НомерЗаписи,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(т.СуммаВВалюте) + ЕСТЬNULL(СУММА(ПрошлыеАвансы.СуммаВВалюте), 0) > МАКСИМУМ(втИтогПозиций.СуммаСНДС)
	|			ТОГДА МАКСИМУМ(втИтогПозиций.СуммаСНДС) - ЕСТЬNULL(СУММА(ПрошлыеАвансы.СуммаВВалюте), 0)
	|		ИНАЧЕ МАКСИМУМ(т.СуммаВВалюте)
	|	КОНЕЦ КАК СуммаВВалюте,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(т.СуммаВВалюте) + ЕСТЬNULL(СУММА(ПрошлыеАвансы.СуммаВВалюте), 0) > МАКСИМУМ(втИтогПозиций.СуммаСНДС)
	|			ТОГДА ВЫРАЗИТЬ((МАКСИМУМ(втИтогПозиций.СуммаСНДС) - ЕСТЬNULL(СУММА(ПрошлыеАвансы.СуммаВВалюте), 0)) * СУММА(т.СуммаВВалютеУчета) / МАКСИМУМ(т.СуммаВВалюте) КАК ЧИСЛО(18, 2))
	|		ИНАЧЕ МАКСИМУМ(т.СуммаВВалютеУчета)
	|	КОНЕЦ КАК СуммаВВалютеУчета,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(т.СуммаВВалюте) + ЕСТЬNULL(СУММА(ПрошлыеАвансы.СуммаВВалюте), 0) > МАКСИМУМ(втИтогПозиций.СуммаСНДС)
	|			ТОГДА ВЫРАЗИТЬ((МАКСИМУМ(втИтогПозиций.СуммаСНДС) - ЕСТЬNULL(СУММА(ПрошлыеАвансы.СуммаВВалюте), 0)) * СУММА(т.СуммаВВалютеОтчетности) / МАКСИМУМ(т.СуммаВВалюте) КАК ЧИСЛО(18, 2))
	|		ИНАЧЕ МАКСИМУМ(т.СуммаВВалютеОтчетности)
	|	КОНЕЦ КАК СуммаВВалютеОтчетности
	|ПОМЕСТИТЬ втПогашенияАвансов
	|ИЗ
	|	втОстаткиАвансов КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втИтогПозиций КАК втИтогПозиций
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиАвансов КАК ПрошлыеАвансы
	|		ПО (ВЫБОР
	|				КОГДА т.ДатаАванса > ПрошлыеАвансы.ДатаАванса
	|					ТОГДА ИСТИНА
	|				КОГДА т.ДатаАванса = ПрошлыеАвансы.ДатаАванса
	|					ТОГДА т.НомерЗаписи >= ПрошлыеАвансы.НомерЗаписи
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	т.НомерЗаписи
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(втИтогПозиций.СуммаСНДС) >= ЕСТЬNULL(СУММА(ПрошлыеАвансы.СуммаВВалюте), 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерЗаписи";

КонецФункции

Функция ТекстЗапроса_втСчетаУчета(НомераТаблиц, ПутиСубконто)
	
	ПоляАналитик = 
	"втРасчеты.АналитикаДКЗ
	|втРасчеты.АналитикаАванс
	|втПозиции.АналитикаАктив 
	|втПозиции.АналитикаНДС 
	|втПозиции.АналитикаДНДС";
	
	Возврат Справочники.ПараметрыОбъектовУчетаМСФО.ТекстЗапроса_втСчетаУчета(НомераТаблиц, ПоляАналитик, ПутиСубконто);
	
КонецФункции

Функция ТекстЗапроса_МСФО(НомераТаблиц, ПутиСубконто)
	
	НомераТаблиц.Вставить("МСФО", НомераТаблиц.Количество());
	
	ТекстЗапроса = Новый Массив;
	ТекстЗапроса.Добавить(ТекстЗапроса_ПроводкаПогашенияАвансов(ПутиСубконто));
	ТекстЗапроса.Добавить(ТекстЗапроса_ПроводкаПоступление(ПутиСубконто));
	ТекстЗапроса.Добавить(ТекстЗапроса_ПроводкаПолученныйНДС(ПутиСубконто));
	
	Возврат СтрСоединить(ТекстЗапроса, " ОБЪЕДИНИТЬ ВСЕ ");
	
КонецФункции

Функция ТекстЗапроса_ДвижениеИнвестиций(НомераТаблиц)

	НомераТаблиц.Вставить("ДвижениеИнвестиций", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Инвестор,
	|	&Сценарий КАК Сценарий,
	|	т.ОбъектИнвестирования КАК ОбъектИнвестирования,
	|	т.Сумма КАК Инвестиции,
	|	0 КАК БалансоваяСтоимость,
	|	т.КоличествоДоп КАК ПрямаяДоляВладения,
	|	т.Содержание КАК ОбоснованиеКонтроля,
	|	т.Количество КАК КоличествоВДоверительномУправлении,
	|	т.Количество КАК КоличествоГолосующих,
	|	т.Количество КАК КоличествоПривилегированных,
	|	т.Количество КАК Количество,
	|	т.ОтношениеКГруппе КАК ОтношениеКГруппе,
	|	т.ОтношениеКГруппе.ВидОтношенияКГруппе = ЗНАЧЕНИЕ(Перечисление.ВидыОтношенийКГруппе.Дочернее) КАК ПризнаниеКонтроля
	|ИЗ
	|	втПозиции КАК т
	|ГДЕ
	|	НЕ т.ОбъектИнвестирования ЕСТЬ NULL";

КонецФункции

Функция ТекстЗапроса_ИсточникРасчетаЭффективныхДолей(НомераТаблиц)
	
	НомераТаблиц.Вставить("ИсточникРасчетаЭффективныхДолей", НомераТаблиц.Количество());
	
	Возврат 
	"ВЫБРАТЬ
	|	&Сценарий КАК Сценарий,
	|	ПрямыеДоли.Инвестор КАК Инвестор,
	|	ПрямыеДоли.ОбъектИнвестирования КАК ОбъектИнвестирования,
	|	СУММА(ПрямыеДоли.ПрямаяДоля) КАК ПрямаяДоля,
	|	МАКСИМУМ(ПрямыеДоли.СтрокаИзменение) КАК СтрокаИзменение,
	|	ПРЕДСТАВЛЕНИЕ(ПрямыеДоли.Инвестор) КАК ИнвесторПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ПрямыеДоли.ОбъектИнвестирования) КАК ОбъектИнвестированияПредставление
	|ИЗ
	|	(ВЫБРАТЬ
	|		Остатки.Инвестор КАК Инвестор,
	|		Остатки.ОбъектИнвестирования КАК ОбъектИнвестирования,
	|		Остатки.ПрямаяДоляВладенияОборот КАК ПрямаяДоля,
	|		ЛОЖЬ КАК СтрокаИзменение
	|	ИЗ
	|		РегистрНакопления.ДвижениеИнвестиций.Обороты(
	|				,
	|				&ГраницаДоДокумента,
	|				,
	|				Сценарий = &Сценарий
	|					И ИСТИНА В
	|						(ВЫБРАТЬ ПЕРВЫЕ 1
	|							ИСТИНА
	|						ИЗ
	|							втПозиции КАК т
	|						ГДЕ
	|							НЕ т.ОбъектИнвестирования ЕСТЬ NULL)) КАК Остатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&Организация,
	|		т.ОбъектИнвестирования,
	|		т.КоличествоДоп,
	|		ИСТИНА
	|	ИЗ
	|		втПозиции КАК т
	|	ГДЕ
	|		НЕ т.ОбъектИнвестирования ЕСТЬ NULL) КАК ПрямыеДоли
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрямыеДоли.Инвестор,
	|	ПрямыеДоли.ОбъектИнвестирования";

КонецФункции

#Область Проводки

Функция ТекстЗапроса_ПроводкаПогашенияАвансов(ПутиСубконто)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Содержание КАК Содержание,
	|	втСчетаУчетаДт.Счет КАК СчетДт,
	|	втСчетаУчетаДт.ВидСубконто1 КАК ВидСубконтоДт1,
	|	втСчетаУчетаДт.ВидСубконто2 КАК ВидСубконтоДт2,
	|	втСчетаУчетаДт.ВидСубконто3 КАК ВидСубконтоДт3,
	|	&ДКЗ_Субконто1 КАК СубконтоДт1,
	|	&ДКЗ_Субконто2 КАК СубконтоДт2,
	|	&ДКЗ_Субконто3 КАК СубконтоДт3,
	|	&ДКЗ_Подразделение КАК ПодразделениеДт,
	|	&ДКЗ_НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	NULL КАК КоличествоДт,
	|	&ДКЗ_Валюта КАК ВалютаДт,
	|	&ДКЗ_СуммаВВалюте КАК СуммаВВалютеДт,
	|	втСчетаУчетаКт.Счет КАК СчетКт,
	|	втСчетаУчетаКт.ВидСубконто1 КАК ВидСубконтоКт1,
	|	втСчетаУчетаКт.ВидСубконто2 КАК ВидСубконтоКт2,
	|	втСчетаУчетаКт.ВидСубконто3 КАК ВидСубконтоКт3,
	|	втОстаткиАвансов.Субконто1 КАК СубконтоКт1,
	|	втОстаткиАвансов.Субконто2 КАК СубконтоКт2,
	|	втОстаткиАвансов.Субконто3 КАК СубконтоКт3,
	|	втОстаткиАвансов.Подразделение КАК ПодразделениеКт,
	|	втОстаткиАвансов.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	NULL КАК КоличествоКт,
	|	ВЫБОР
	|		КОГДА втСчетаУчетаКт.Валютный
	|			ТОГДА втОстаткиАвансов.Валюта
	|	КОНЕЦ КАК ВалютаКт,
	|	ВЫБОР
	|		КОГДА втСчетаУчетаКт.Валютный
	|			ТОГДА втОстаткиАвансов.СуммаВВалюте
	|	КОНЕЦ КАК СуммаВВалютеКт,
	|	&Организация КАК Организация,
	|	&Сценарий КАК Сценарий,
	|	втОстаткиАвансов.СуммаВВалютеУчета КАК СуммаВВалютеУчета,
	|	втОстаткиАвансов.СуммаВВалютеОтчетности КАК СуммаВВалютеОтчетности,
	|	ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ЗачетПервоначальногоАвансаСуммаБезНДС) КАК ВидОперации
	|ИЗ
	|	втРасчеты КАК втРасчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОстаткиАвансов КАК втОстаткиАвансов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПогашенияАвансов КАК втПогашенияАвансов
	|			ПО втОстаткиАвансов.НомерЗаписи = втПогашенияАвансов.НомерЗаписи
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСчетаУчета КАК втСчетаУчетаДт
	|		ПО втРасчеты.АналитикаДКЗ = втСчетаУчетаДт.АналитикаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСчетаУчета КАК втСчетаУчетаКт
	|		ПО втРасчеты.АналитикаАванс = втСчетаУчетаКт.АналитикаУчета";
	
	КодЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	Содержание = НСтр("ru = 'Зачет аванса'", КодЯзыка);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Содержание", СтрШаблон(" ""%1"" ", Содержание));
	
	ФункцииЗамены = Новый Структура("Подразделение, НаправлениеДеятельности, Валюта, СуммаВВалюте, Количество",
		"втРасчеты.Подразделение", "втРасчеты.НаправлениеДеятельности", "втРасчеты.ВалютаДокумента",
		"втОстаткиАвансов.СуммаВВалюте", "втПозиции.Количество");
	МСФОУХ.ЗаменыСубконто(ФункцииЗамены, "втСчетаУчетаДт", ПутиСубконто, Истина);
	
	ЗаменыЗапроса = МСФОУХ.ЗаменыЗапросаПоПрефиксу("&ДКЗ_");
	МСФОУХ.ЗаменитьАналитикуУчета(ТекстЗапроса, "втСчетаУчетаДт", ФункцииЗамены, ЗаменыЗапроса);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапроса_ПроводкаПоступление(ПутиСубконто)

	ТекстЗапроса =	
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Содержание КАК Содержание,
	|	втСчетаУчетаДт.Счет КАК СчетДт,
	|	втСчетаУчетаДт.ВидСубконто1 КАК ВидСубконтоДт1,
	|	втСчетаУчетаДт.ВидСубконто2 КАК ВидСубконтоДт2,
	|	втСчетаУчетаДт.ВидСубконто3 КАК ВидСубконтоДт3,
	|	&А_Субконто1 КАК СубконтоДт1,
	|	&А_Субконто2 КАК СубконтоДт2,
	|	&А_Субконто3 КАК СубконтоДт3,
	|	&А_Подразделение КАК ПодразделениеДт,
	|	&А_НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	&А_Количество КАК КоличествоДт,
	|	&А_Валюта КАК ВалютаДт,
	|	&А_СуммаВВалюте КАК СуммаВВалютеДт,
	|	втСчетаУчетаКт.Счет КАК СчетКт,
	|	втСчетаУчетаКт.ВидСубконто1 КАК ВидСубконтоКт1,
	|	втСчетаУчетаКт.ВидСубконто2 КАК ВидСубконтоКт2,
	|	втСчетаУчетаКт.ВидСубконто3 КАК ВидСубконтоКт3,
	|	&ДКЗ_Субконто1 КАК СубконтоКт1,
	|	&ДКЗ_Субконто2 КАК СубконтоКт2,
	|	&ДКЗ_Субконто3 КАК СубконтоКт3,
	|	&ДКЗ_Подразделение КАК ПодразделениеКт,
	|	&ДКЗ_НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	NULL КАК КоличествоКт,
	|	&ДКЗ_Валюта КАК ВалютаКт,
	|	&ДКЗ_СуммаВВалюте КАК СуммаВВалютеКт,
	|	&Организация КАК Организация,
	|	&Сценарий КАК Сценарий,
	|	втПозиции.СуммаБезНДС * втРасчеты.КурсВД * втРасчеты.КратностьФВ / (втРасчеты.КурсФВ * втРасчеты.КратностьВД) КАК СуммаВВалютеУчета,
	|	втПозиции.СуммаБезНДС * втРасчеты.КурсВД * втРасчеты.КратностьВО / (втРасчеты.КурсВО * втРасчеты.КратностьВД) КАК СуммаВВалютеОтчетности,
	|	ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ПоступлениеОтПоставщика) КАК ВидОперации
	|ИЗ
	|	втПозиции КАК втПозиции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРасчеты КАК втРасчеты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСчетаУчета КАК втСчетаУчетаДт
	|		ПО втПозиции.АналитикаАктив = втСчетаУчетаДт.АналитикаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСчетаУчета КАК втСчетаУчетаКт
	|		ПО (втРасчеты.АналитикаДКЗ = втСчетаУчетаКт.АналитикаУчета)";
	
	КодЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	Содержание = НСтр("ru = 'Поступление от поставщика'", КодЯзыка);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Содержание", СтрШаблон(" ""%1"" ", Содержание));

	ФункцииЗамены = Новый Структура("Подразделение, НаправлениеДеятельности, Валюта, СуммаВВалюте, Количество", 
		"втРасчеты.Подразделение", "втРасчеты.НаправлениеДеятельности", "втРасчеты.ВалютаДокумента", 
		"втПозиции.СуммаБезНДС", "втПозиции.Количество");	
	
	МСФОУХ.ЗаменыСубконто(ФункцииЗамены, "втСчетаУчетаКт", ПутиСубконто);	
	ЗаменыЗапроса = МСФОУХ.ЗаменыЗапросаПоПрефиксу("&ДКЗ_");
	МСФОУХ.ЗаменитьАналитикуУчета(ТекстЗапроса, "втСчетаУчетаКт", ФункцииЗамены, ЗаменыЗапроса);
	
	МСФОУХ.ЗаменыСубконто(ФункцииЗамены, "втСчетаУчетаДт", ПутиСубконто);
	ЗаменыЗапроса = МСФОУХ.ЗаменыЗапросаПоПрефиксу("&А_");
	МСФОУХ.ЗаменитьАналитикуУчета(ТекстЗапроса, "втСчетаУчетаДт", ФункцииЗамены, ЗаменыЗапроса);
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапроса_ПроводкаПолученныйНДС(ПутиСубконто)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Содержание КАК Содержание,
	|	втСчетаУчетаДт.Счет КАК СчетДт,
	|	втСчетаУчетаДт.ВидСубконто1 КАК ВидСубконтоДт1,
	|	втСчетаУчетаДт.ВидСубконто2 КАК ВидСубконтоДт2,
	|	втСчетаУчетаДт.ВидСубконто3 КАК ВидСубконтоДт3,
	|	&НДС_Субконто1 КАК СубконтоДт1,
	|	&НДС_Субконто2 КАК СубконтоДт2,
	|	&НДС_Субконто3 КАК СубконтоДт3,
	|	&НДС_Подразделение КАК ПодразделениеДт,
	|	&НДС_НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	&НДС_Количество КАК КоличествоДт,
	|	&НДС_Валюта КАК ВалютаДт,
	|	&НДС_СуммаВВалюте КАК СуммаВВалютеДт,
	|	втСчетаУчетаКт.Счет КАК СчетКт,
	|	втСчетаУчетаКт.ВидСубконто1 КАК ВидСубконтоКт1,
	|	втСчетаУчетаКт.ВидСубконто2 КАК ВидСубконтоКт2,
	|	втСчетаУчетаКт.ВидСубконто3 КАК ВидСубконтоКт3,
	|	&ДКЗ_Субконто1 КАК СубконтоКт1,
	|	&ДКЗ_Субконто2 КАК СубконтоКт2,
	|	&ДКЗ_Субконто3 КАК СубконтоКт3,
	|	&ДКЗ_Подразделение КАК ПодразделениеКт,
	|	&ДКЗ_НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	NULL КАК КоличествоКт,
	|	&ДКЗ_Валюта КАК ВалютаКт,
	|	&ДКЗ_СуммаВВалюте КАК СуммаВВалютеКт,
	|	&Организация КАК Организация,
	|	&Сценарий КАК Сценарий,
	|	втПозиции.СуммаНДС * втРасчеты.КурсВД * втРасчеты.КратностьФВ / (втРасчеты.КурсФВ * втРасчеты.КратностьВД) КАК СуммаВВалютеУчета,
	|	втПозиции.СуммаНДС * втРасчеты.КурсВД * втРасчеты.КратностьВО / (втРасчеты.КурсВО * втРасчеты.КратностьВД) КАК СуммаВВалютеОтчетности,
	|	ЗНАЧЕНИЕ(Справочник.ВидыОпераций.НДСПолученный) КАК ВидОперации
	|ИЗ
	|	втПозиции КАК втПозиции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРасчеты КАК втРасчеты
	|		ПО (ИСТИНА)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСчетаУчета КАК втСчетаУчетаДт
	|		ПО втПозиции.АналитикаНДС = втСчетаУчетаДт.АналитикаУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСчетаУчета КАК втСчетаУчетаКт
	|		ПО (втРасчеты.АналитикаДКЗ = втСчетаУчетаКт.АналитикаУчета)
	|ГДЕ
	|	втПозиции.СуммаНДС <> 0";

	КодЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	Содержание = НСтр("ru = 'НДС полученный'", КодЯзыка);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Содержание", СтрШаблон(" ""%1"" ", Содержание));

	ФункцииЗамены = Новый Структура("Подразделение, НаправлениеДеятельности, Валюта, СуммаВВалюте, Количество",
		"втРасчеты.Подразделение", "втРасчеты.НаправлениеДеятельности", "втРасчеты.ВалютаДокумента",
		"втПозиции.СуммаНДС", "втПозиции.Количество");	
	
	МСФОУХ.ЗаменыСубконто(ФункцииЗамены, "втСчетаУчетаКт", ПутиСубконто);
	ЗаменыЗапроса = МСФОУХ.ЗаменыЗапросаПоПрефиксу("&ДКЗ_");
	МСФОУХ.ЗаменитьАналитикуУчета(ТекстЗапроса, "втСчетаУчетаКт", ФункцииЗамены, ЗаменыЗапроса);
	
	МСФОУХ.ЗаменыСубконто(ФункцииЗамены, "втСчетаУчетаДт", ПутиСубконто);
	ЗаменыЗапроса = МСФОУХ.ЗаменыЗапросаПоПрефиксу("&НДС_");
	МСФОУХ.ЗаменитьАналитикуУчета(ТекстЗапроса, "втСчетаУчетаДт", ФункцииЗамены, ЗаменыЗапроса);

	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
